{
	"className": "Druid",
	"startingEquipment": {
		"weaponsOrShields": ["1 Weapon"],
		"armor": "1 set of Light Armor",
		"packs": "X or Y “Packs” (Adventuring Packs Coming Soon)"
	},
	"spellcastingPath": {
		"combatTraining": {
			"armor": ["Light Armor"]
		},
		"spellList": {
			"type": "specific",
			"listName": "Primal Spell List",
			"betaNote": "You can choose from the following Spells when picking your Cantrips and Spells Known:\nCantrips: Poison Bolt, Lightning Bolt, Frost Bolt, Fire Bolt, Close Wounds, Gust, Dancing Flames\n1 MP Spells: Heal, Crackling Lightning, Return Shock, Ice Knife, Grease, Fire Shield, Fog Cloud, Burning Flames, Tethering Vines"
		},
		"cantrips": {
			"knownIncreasesBy": "Cantrips Known column of the Druid Class Table",
			"description": "Cantrips are Spells with the Cantrip Spell Tag."
		},
		"spells": {
			"knownIncreasesBy": "Spells Known column of the Druid Class Table",
			"description": "These can be Spells with or without the Cantrip Spell Tag."
		},
		"manaPoints": {
			"maximumIncreasesBy": "Mana Points column of the Druid Class Table"
		}
	},
	"coreFeatures": [
		{
			"featureName": "Druid Domain",
			"levelGained": 1,
			"description": "You can spend 1 AP and 1 MP to create your own Druid Domain that includes small plant life, sand, shallow water, or other naturally occurring features. You create up to 8 Domain Spaces along the ground or walls. The first Domain Space must be within 1 Space of you, and each additional Domain Space must be adjacent to another Domain Space. If you use this Feature again, the first Domain Space of it must be within 1 Space of you or another Domain Space.\nDomain Spaces: The area is considered to be Difficult Terrain for creatures of your choice, and when you cast a Spell, you can do so as if you were standing in any Space within your Domain.\nLosing Domain Spaces: A Domain Space also disappears if you end your turn farther than 15 Spaces away from it or you die.\nDomain Actions: While you have Domain Spaces, you can take any of the following Domain Actions:\n• Nature's Grasp: You can spend 1 AP to attempt to bind a creature of your choice within your Domain. Make a Spell Check against the target's Repeated Physical Save. Success: The target is bound by your Domain, preventing it from moving for 1 minute or until the Domain Space it occupies ends.\n• Move Creature: You can spend 1 AP to move a creature bound by this feature up to 2 Spaces within your Domain.\n• Move Object: You can take the Object Action to use your vines to interact with any object within your Domain as if you were standing in any of your Domain Spaces. When you do, you can move the object up to 5 Spaces within your Domain.\n• Wild Growth: You can spend 1 AP and 1 MP to make a DC 10 Spell Check to heal a target within your Domain. Success: The target immediately regains 2 HP. For the next minute, they regain an additional 1 HP each time they end their turn within your Domain. Success (each 5): They immediately regain +1 HP. Failure: The target only regains 2 HP immediately."
		},
		{
			"featureName": "Wild Form",
			"levelGained": 1,
			"description": "You can spend 1 AP and 1 MP to transform into a Wild Form of your choice. You can spend 1 AP on your turn to shift back and forth between your True Form and any Wild Forms you currently have available. Once per Long Rest, you can transform without spending MP or using MP enhancements.\nTrue Form: When you transform from your Wild Form to your True Form, your statistics return to normal. You immediately revert to your True Form when your Wild Form HP is reduced to 0 or you die.\nWild Form: When you transform into a Wild Form, you gain the Wild Form's current Wild Form HP (see Wild Form HP below), retaining any HP losses. \n• Duration: Each Wild Form remains available until its Wild Form HP is reduced to 0 or you complete a Long Rest.\n• Multiple Forms: You can have multiple Wild Forms available at a time which have their own Wild Form HP and Traits.\n• Equipment: Your equipment falls to the ground or merges into your Wild Form (your choice for each item). You gain the benefits of Magic Items merged with your Wild Form, but you can't activate them or spend their charges.\nStatistics: While in your Wild Form, you're subjected to the following changes (unless otherwise stated):\n• Stat Block: You use the Wild Form Stat Block below to determine your statistics.\n• Identity: You maintain your personality, intellect, and ability to speak.\n• Wild Form HP: You gain a secondary pool of Wild Form Health Points, which is 3 with a maximum of 3. Damage and healing effects target your Wild Form HP before your True Form HP, and any excess damage or healing carries over to your own HP.\n• Natural Weapon: You have Natural Weapons (claws, horns, fangs, etc.) which you can use to make Unarmed Strikes that deal 1 Bludgeoning, Piercing, or Slashing damage (your choice when you use this Feature).\n• Features & Talents: You don't benefit from Talents or Class Features, except Druid Class Features, Subclass Features, and Talents. Additionally, you can't cast Spells or perform Techniques.\n• Traits: You don't benefit from your Ancestry Traits, but you gain 3 Trait Points to spend on Beast Traits or Wild Form Traits of your choice. You can't select negative Beast Traits. When you use this Feature, you can spend additional MP (up to your Mana Spend Limit) to gain 2 additional Trait Points per MP spent."
		},
		{
			"featureName": "Wild Speech (Flavor)",
			"levelGained": 1,
			"description": "You learn the Druidcraft Cantrip and can choose 1 of the following options:\n• Animals: You can understand and speak with Beasts in a limited manner. You can understand the meaning of their movements, sounds, and behaviors, and they can understand the meanings of simple words, concepts, and emotions.\n• Plants: You can understand and speak with Plants in a limited manner. You can understand the meaning of their swaying, folding, unfolding of their leaves and flowers, and they can understand the meanings of simple words, concepts, and emotions.\n• Weather: You can reach out to nature and cast the Commune with Nature Spell as a Ritual once per Long Rest.",
			"isFlavor": true
		},
		{
			"featureName": "Nature's Torrent",
			"levelGained": 2,
			"description": "When a creature within 10 spaces of you takes Elemental damage, you can spend 1 AP as a Reaction to summon a torrent of nature. The torrent fills a 1 Space Radius Sphere centered on the target that lasts for 1 minute. While creatures are within the area, they have Vulnerability (1) against the triggering damage type and have DisADV on Checks and Saves to resist being moved or knocked Prone. Ending Early: The torrent ends early if you use this Feature again, become Incapacitated, die, or choose to end it for free at anytime."
		},
		{
			"featureName": "Talent",
			"levelGained": 2,
			"description": "You gain 1 Talent of your choice. If the Talent has any prerequisites, you must meet those prerequisites to choose that Talent."
		}
	],
	"subclasses": [
		{
			"subclassName": "Phoenix",
			"features": [
				{
					"featureName": "Flames of Rebirth",
					"levelGained": 3,
					"description": "You wield the power of fire to lay destruction to what exists and foster new life. You gain the following benefits:\n• Fiery Form: When you use your Wild Form, you can choose for your creature type to become Elemental (Fire) instead of Beast. Additionally, your Wild Forms gain Fire Resistance (1) and you can choose Fire as the damage type of your Wild Form's Natural Weapon.\n• Cleansing Flames: When a creature within your Druid Domain is Healed by one of your MP effects, you can remove one of the following Conditions from it: Impaired, Dazed, Burning, or Poisoned.\n• Rolling Wild Fire: Creatures of your choice take 1 Fire damage for each Space they move within your Druid Domain, or if they start their turn within your Domain."
				},
				{
					"featureName": "Fire Within (Flavor Feature)",
					"levelGained": 3,
					"description": "You are unaffected by cold weather conditions and can bring a gallon (4 liters) of liquid to a boil after making physical contact with it or its container for 1 minutes.",
					"isFlavor": true
				}
			]
		},
		{
			"subclassName": "Rampant Growth",
			"features": [
				{
					"featureName": "Overgrowth",
					"levelGained": 3,
					"description": "You gain the following benefits:\n• Plant Form: When you use your Wild Form, you can choose for your creature type to become Plant instead of Beast. Additionally, your Wild Forms become immune to Bleeding and you can choose Poison as the damage type of your Wild Form's Natural Weapon.\n• Vineguard: Plant-life in your Domain swirls to protect and support you. Creatures of your choice within your Domain gain the benefits of 1/2 Cover.\n• Thorny Grasp: When a creature fails a Save against your Nature's Grasp, it begins Bleeding."
				},
				{
					"featureName": "Seed Vault (Flavor Feature)",
					"levelGained": 3,
					"description": "You can magically produce the seeds of any mundane plant that you've ever touched.",
					"isFlavor": true
				}
			]
		}
	]
}
